In [2]:
from sqlalchemy import text
import sqlalchemy as db
import pandas as pd

In [3]:
# Set up the connection string
connection_string = 'mssql+pyodbc://sa:yourStrong(!)Password@localhost:1433/Northwind?driver=ODBC+Driver+17+for+SQL+Server'
# Create a SQLAlchemy engine object
engine = db.create_engine(connection_string)
# Create a connection object
connection = engine.connect()

In [6]:
ins = db.inspect(engine)
print(ins.get_table_names())

['Categories', 'CustomerCustomerDemo', 'CustomerDemographics', 'Customers', 'Employees', 'EmployeeTerritories', 'Order Details', 'Orders', 'Products', 'Region', 'Shippers', 'Suppliers', 'Territories', 'test_table']

In [7]:
metadata = db.MetaData()
customers = db.Table('Customers', metadata, autoload_with=engine, extend_existing=True)

In [13]:
query = db.select((customers))
result = connection.execute(query).fetchall()
result[:3]

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', None, '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', None, '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquería', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'México D.F.', None, '05023', 'Mexico', '(5) 555-3932', None)]

## Simple SELECT Statement

In [39]:
connection = engine.connect()
query = text('SELECT * FROM Customers')
result = connection.execute(query)
df = pd.DataFrame(result)
connection.close()
df

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,None,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,None,05021,Mexico,(5) 555-4729,(5) 555-3745
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,None,05023,Mexico,(5) 555-3932,None
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,None,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,BERGS,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,None,S-958 22,Sweden,0921-12 34 65,0921-12 34 67
...,...,...,...,...,...,...,...,...,...,...,...
86,WARTH,Wartian Herkku,Pirkko Koskitalo,Accounting Manager,Torikatu 38,Oulu,None,90110,Finland,981-443655,981-443655
87,WELLI,Wellington Importadora,Paula Parente,Sales Manager,"Rua do Mercado, 12",Resende,SP,08737-363,Brazil,(14) 555-8122,None
88,WHITC,White Clover Markets,Karl Jablonski,Owner,305 - 14th Ave. S. Suite 3B,Seattle,WA,98128,USA,(206) 555-4112,(206) 555-4115
89,WILMK,Wilman Kala,Matti Karttunen,Owner/Marketing Assistant,Keskuskatu 45,Helsinki,None,21240,Finland,90-224 8858,90-224 8858
90,WOLZA,Wolski Zajazd,Zbyszek Piestrzeniewicz,Owner,ul. Filtrowa 68,Warszawa,None,01-012,Poland,(26) 642-7012,(26) 642-7012

### Filtering the dataframe by first 3

In [36]:
df[:3]

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,None,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,None,05021,Mexico,(5) 555-4729,(5) 555-3745
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,None,05023,Mexico,(5) 555-3932,None

### Filtering the dataframe by only rows which match Germany and Berlin

In [35]:
df[(df['Country'] == 'Germany') & (df['City'] == 'Berlin')]

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,None,12209,Germany,030-0074321,030-0076545

## SELECT WHERE Query with multiple option condition

In [40]:
connection = engine.connect()
query = text("SELECT ContactName, City, Country FROM Customers WHERE Country IN ('France','Poland')")
result = connection.execute(query)
df = pd.DataFrame(result)
connection.close()
df

                ContactName        City Country
0        Frédérique Citeaux  Strasbourg  France
1          Laurence Lebihan   Marseille  France
2            Janine Labrune      Nantes  France
3             Martine Rancé       Lille  France
4            Carine Schmitt      Nantes  France
5             Daniel Tonini  Versailles  France
6            Annette Roulet    Toulouse  France
7            Marie Bertrand       Paris  France
8         Dominique Perrier       Paris  France
9              Mary Saveley        Lyon  France
10             Paul Henriot       Reims  France
11  Zbyszek Piestrzeniewicz    Warszawa  Poland

## SELECT WHERE using condition with wildcard

In [41]:
connection = engine.connect()
query = text("SELECT ContactName, City, Country FROM Customers WHERE Country like 'U%'")
result = connection.execute(query)
df = pd.DataFrame(result)
connection.close()
df

           ContactName           City Country
0         Thomas Hardy         London      UK
1    Victoria Ashworth         London      UK
2      Elizabeth Brown         London      UK
3            Ann Devon         London      UK
4        Howard Snyder         Eugene     USA
5        Yoshi Latimer          Elgin     USA
6        Helen Bennett          Cowes      UK
7           John Steel    Walla Walla     USA
8         Jaime Yorres  San Francisco     USA
9          Fran Wilson       Portland     USA
10      Simon Crowther         London      UK
11       Rene Phillips      Anchorage     USA
12        Paula Wilson    Albuquerque     USA
13      Jose Pavarotti          Boise     USA
14          Hari Kumar         London      UK
15  Art Braunschweiger         Lander     USA
16           Liz Nixon       Portland     USA
17            Liu Wong          Butte     USA
18      Helvetius Nagy       Kirkland     USA
19      Karl Jablonski        Seattle     USA

### Applying groupby to extracted dataframe to aggregate by counting the occurances of the different cities

In [50]:
df.groupby('City').agg({'Country':'count'}).sort_values('Country',ascending=False)

               Country
City
London               6
Portland             2
Albuquerque          1
Anchorage            1
Boise                1
Butte                1
Cowes                1
Elgin                1
Eugene               1
Kirkland             1
Lander               1
San Francisco        1
Seattle              1
Walla Walla          1

## SELECT WHERE using BETWEEN two dates

In [51]:
connection = engine.connect()
query = text("SELECT OrderID, ShipCity, ShipCountry FROM Orders WHERE OrderDate BETWEEN '1996-07-19' AND '1996-11-11'")
result = connection.execute(query)
df = pd.DataFrame(result)
connection.close()
df

    OrderID        ShipCity ShipCountry
0     10260            Köln     Germany
1     10261  Rio de Janeiro      Brazil
2     10262     Albuquerque         USA
3     10263            Graz     Austria
4     10264          Bräcke      Sweden
..      ...             ...         ...
87    10347       Sao Paulo      Brazil
88    10348       Stuttgart     Germany
89    10349          Lander         USA
90    10350        Toulouse      France
91    10351            Graz     Austria

[92 rows x 3 columns]

### Applying group by to extracted dataframe, grouping by both city and country, then counting occurances of groups

In [53]:
df.groupby(['ShipCity','ShipCountry']).agg('count').sort_values('OrderID',ascending=False)

                            OrderID
ShipCity       ShipCountry
Albuquerque    USA                6
México D.F.    Mexico             6
Cunewalde      Germany            5
Madrid         Spain              4
Rio de Janeiro Brazil             4
Oulu           Finland            4
Stuttgart      Germany            3
München        Germany            3
Cork           Ireland            3
Cowes          UK                 3
Barquisimeto   Venezuela          3
Frankfurt a.M. Germany            3
Portland       USA                3
Sao Paulo      Brazil             3
Lander         USA                3
Luleå          Sweden             2
Montréal       Canada             2
Marseille      France             2
Bergamo        Italy              2
Reims          France             2
Bräcke         Sweden             2
Anchorage      USA                2
Lisboa         Portugal           2
Strasbourg     France             2
Graz           Austria            2
Brandenburg    Germany            2
Seattle        USA                2
Sevilla        Spain              1
Reggio Emilia  Italy              1
London         UK                 1
Nantes         France             1
Lyon           France             1
Leipzig        Germany            1
Köln           Germany            1
Kobenhavn      Denmark            1
Charleroi      Belgium            1
Caracas        Venezuela          1
Boise          USA                1
Toulouse       France             1

## SELECT GROUP BY directly from the sql statement

In [54]:
connection = engine.connect()
query = text("SELECT Country, COUNT(*) FROM Customers GROUP BY (Country)")
result = connection.execute(query)
df = pd.DataFrame(result)
connection.close()
df

        Country
0     Argentina   3
1       Austria   2
2       Belgium   2
3        Brazil   9
4        Canada   3
5       Denmark   2
6       Finland   2
7        France  11
8       Germany  11
9       Ireland   1
10        Italy   3
11       Mexico   5
12       Norway   1
13       Poland   1
14     Portugal   2
15        Spain   5
16       Sweden   2
17  Switzerland   2
18           UK   7
19          USA  13
20    Venezuela   4

## Joining multiple tables then grouping by the customer country and calculating the average quantity of orders in the different countries

In [56]:
connection = engine.connect()
query = text("SELECT c.Country, AVG(od.Quantity) AS 'Quantity' FROM Customers c JOIN Orders o ON c.CustomerID = o.CustomerID JOIN [Order Details] od ON o.OrderID = od.OrderID JOIN Products p ON od.ProductID = p.ProductID GROUP BY (Country)")
result = connection.execute(query)
df = pd.DataFrame(result)
connection.close()
df

        Country  Quantity
0       Finland        16
1           USA        26
2         Italy        15
3        Brazil        20
4       Germany        28
5   Switzerland        24
6        Mexico        14
7        Sweden        23
8     Argentina         9
9       Austria        41
10           UK        20
11       Poland        12
12       Canada        26
13      Ireland        30
14       Norway        10
15       France        17
16      Belgium        24
17        Spain        13
18    Venezuela        24
19      Denmark        25
20     Portugal        17